package homework11;

public class Task2 {
    public static void main(String[] args) {
        /*
        Написать свой метод copyOfArray, дублирующий функционал метода Arrays.copyOf()
        на вход принимает массив целых чисел и число - длинну нового массива.
        Метод должен создать и распечатать массив заданной в параметрах длинны.
        В начало массива должны быть скопированы элементы из входящего массива:
        {0, 1, 2, 3, 4 , 5, 6} -> copyOfArray(array, 3) -> вывод на печать {0, 1, 2}
         */


    }


}
